In [1]:
import pandas as pd

* series----1d array
* data frame----2d array(table format,row & col)

In [2]:
a = pd.Series([])
b = pd.Series([1,2,33,47,58,100])
c = pd.Series((45,89,20,30,44))
d = pd.Series({'a':10,'b':20,'c':50,'d':34})

C:\Users\lenovo\AppData\Local\Temp\ipykernel_816\4035832138.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  a = pd.Series([])

In [3]:
print(type(a))
print(type(b))
print(type(c))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [4]:
a

Series([], dtype: float64)

In [5]:
import pandas as pd

In [6]:
b = pd.Series([1,2,33,47,58,100])

In [7]:
b

0      1
1      2
2     33
3     47
4     58
5    100
dtype: int64

In [8]:
import numpy as np

In [9]:
n=np.array([1,2,3,4,40])

In [10]:
x=pd.Series(n)

In [11]:
x

0     1
1     2
2     3
3     4
4    40
dtype: int32

In [12]:
type(x)

pandas.core.series.Series

In [13]:
b=pd.Series([1,2,[11,10],33,[12,23],47,58,100])

In [14]:
b

0           1
1           2
2    [11, 10]
3          33
4    [12, 23]
5          47
6          58
7         100
dtype: object

In [15]:
b[0]

1

In [16]:
b[3:7]

3          33
4    [12, 23]
5          47
6          58
dtype: object

In [17]:
d

a    10
b    20
c    50
d    34
dtype: int64

In [18]:
d['d']

34

In [19]:
d['b':]

b    20
c    50
d    34
dtype: int64

In [20]:
s=pd.Series([12,52,42,10,23],index=['q','w','e','r','t'])

In [21]:
s

q    12
w    52
e    42
r    10
t    23
dtype: int64

In [22]:
s1=pd.Series([12,52,42,10,23],index=list('jfskj'))

In [23]:
s1

j    12
f    52
s    42
k    10
j    23
dtype: int64

In [24]:
s2=pd.Series([12,52,42,10,23,54,23,52,12,23])

In [25]:
s2

0    12
1    52
2    42
3    10
4    23
5    54
6    23
7    52
8    12
9    23
dtype: int64

In [26]:
s2.value_counts()

23    3
12    2
52    2
42    1
10    1
54    1
dtype: int64

In [27]:
s2.argmax()

5

In [28]:
s2.argmin()

3

In [29]:
s.argmax()

1

In [30]:
s.argmin()

3

In [31]:
s1.idxmax()

'f'

In [32]:
s1.idxmin()

'k'

# dataframe

In [33]:
a=pd.DataFrame()
b=pd.DataFrame([1,2,55,40,86])

In [34]:
a

Empty DataFrame
Columns: []
Index: []

In [35]:
b

    0
0   1
1   2
2  55
3  40
4  86

In [36]:
type(b)

pandas.core.frame.DataFrame

In [37]:
c=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])

In [38]:
c

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [39]:
d=pd.DataFrame([[1,2,3,5,3],[4,5,6,4,3],[7,8,9,7,8],[10,11,12,9,1],[13,14,15,7,45]])

In [40]:
d

    0   1   2  3   4
0   1   2   3  5   3
1   4   5   6  4   3
2   7   8   9  7   8
3  10  11  12  9   1
4  13  14  15  7  45

In [41]:
d.head() ## for first five

    0   1   2  3   4
0   1   2   3  5   3
1   4   5   6  4   3
2   7   8   9  7   8
3  10  11  12  9   1
4  13  14  15  7  45

In [42]:
d.tail() ## for last five

    0   1   2  3   4
0   1   2   3  5   3
1   4   5   6  4   3
2   7   8   9  7   8
3  10  11  12  9   1
4  13  14  15  7  45

In [43]:
d.tail(1)

    0   1   2  3   4
4  13  14  15  7  45

In [44]:
d.sample(4)

    0   1   2  3   4
1   4   5   6  4   3
0   1   2   3  5   3
2   7   8   9  7   8
4  13  14  15  7  45

In [45]:
d=pd.DataFrame([[1,2],[4,5,6],[7,8],[10,34,12,9,1],[7,8,np.nan,'missig'],[13,14,15,7,45],[4,2,3]],columns=['colA','colB','colC','colD','colE'])

In [46]:
d

   colA  colB  colC    colD  colE
0     1     2   NaN    None   NaN
1     4     5   6.0    None   NaN
2     7     8   NaN    None   NaN
3    10    34  12.0       9   1.0
4     7     8   NaN  missig   NaN
5    13    14  15.0       7  45.0
6     4     2   3.0    None   NaN

In [47]:
d['colC']

0     NaN
1     6.0
2     NaN
3    12.0
4     NaN
5    15.0
6     3.0
Name: colC, dtype: float64

In [48]:
d[['colC','colD']]

   colC    colD
0   NaN    None
1   6.0    None
2   NaN    None
3  12.0       9
4   NaN  missig
5  15.0       7
6   3.0    None

In [49]:
d[['colC','colD']][0:3]

   colC  colD
0   NaN  None
1   6.0  None
2   NaN  None

In [50]:
d[['colC','colD']].head(3)

   colC  colD
0   NaN  None
1   6.0  None
2   NaN  None

In [51]:
d.shape

(7, 5)

In [52]:
d['colA'].max()

13

In [53]:
d['colum7']=[1,5,7,8,5,6,7]

In [54]:
d

   colA  colB  colC    colD  colE  colum7
0     1     2   NaN    None   NaN       1
1     4     5   6.0    None   NaN       5
2     7     8   NaN    None   NaN       7
3    10    34  12.0       9   1.0       8
4     7     8   NaN  missig   NaN       5
5    13    14  15.0       7  45.0       6
6     4     2   3.0    None   NaN       7

In [55]:
d['colum8']=[1,9,0,8,2,6,7]

In [56]:
d

   colA  colB  colC    colD  colE  colum7  colum8
0     1     2   NaN    None   NaN       1       1
1     4     5   6.0    None   NaN       5       9
2     7     8   NaN    None   NaN       7       0
3    10    34  12.0       9   1.0       8       8
4     7     8   NaN  missig   NaN       5       2
5    13    14  15.0       7  45.0       6       6
6     4     2   3.0    None   NaN       7       7

In [57]:
d['colf']=d['colum7']+d['colum8']

In [58]:
d

   colA  colB  colC    colD  colE  colum7  colum8  colf
0     1     2   NaN    None   NaN       1       1     2
1     4     5   6.0    None   NaN       5       9    14
2     7     8   NaN    None   NaN       7       0     7
3    10    34  12.0       9   1.0       8       8    16
4     7     8   NaN  missig   NaN       5       2     7
5    13    14  15.0       7  45.0       6       6    12
6     4     2   3.0    None   NaN       7       7    14

In [59]:
f=d['colB']>14

In [60]:
d[f]

   colA  colB  colC colD  colE  colum7  colum8  colf
3    10    34  12.0    9   1.0       8       8    16

In [61]:
d[f]['colB']

3    34
Name: colB, dtype: int64